//*****************************************************************************
// 文件名 : SampleAreaListItem.h
// 
// 类名   : 样本区配置列表项数据,本列表位于【测试】页上的【样本区配置】对话框上
// 
// 更新日期     修订人       修改内容         
// ------------------------------------------
// 2014-1       崔志雷       新建
// ------------------------------------------
// 备注：
// ------------------------------------------
// 
//*****************************************************************************
#pragma once
#include "ListItemData.h"
namespace SampleAreaList
{
	enum ListColumn
	{
		colPos = 0,					// 位置编号
		colType,					// 类型，标准品或非标准品
		colSampleNo,				// 样本编号（或标准品批号）
		colProject,					// 检测项目
		colRepeats,					// 重复次数
		colTestState,				// 测试状态
		ColumnCount
	};	
}
using namespace SampleAreaList;

class CSampleAreaListItem :	public CListItemData
{
public:
	CSampleAreaListItem(const Sample_Pos & SamplePos,const Reagent_Pos &ReagentPos);
	~CSampleAreaListItem(void);

	// ---------------------------------------------------------------------------
	// 摘要：
	//     判断本项某字段是否与另外某项数据同字段相等，
	//     当相等时，绘制表格时需要合并为一个单元格
	// 参数：
	//     1.ColumnIndex - 列索引
	//     2.pItemData - 上列表项数据指针
	// ---------------------------------------------------------------------------
	virtual bool IsFieldEquivalent(const int &ColumnIndex,const CListItemData * pItemData);

	// ---------------------------------------------------------------------------
	// 摘要：
	//     取得某单元格文本内容
	// 参数：
	//     1.ColumnIndex - 列索引
	//     2.contex - 文本内容
	// 返回值：
	//     文本对齐格式
	// ---------------------------------------------------------------------------
	virtual UINT GetCellContex(const int &ColumnIndex,CString & contex);

	// ---------------------------------------------------------------------------
	// 摘要：
	//     取得子项目个数
	// ---------------------------------------------------------------------------
	virtual int GetSubItemCount()
	{
		return (int)ColumnCount;
	}

	// ---------------------------------------------------------------------------
	// 摘要：
	//     取得某列属性
	// ---------------------------------------------------------------------------
	virtual ColumnProperties GetColumnProperties(const int &ColumnIndex)
	{
		return CanNotChange;
	}

	// ---------------------------------------------------------------------------
	// 摘要：
	//     判断本项是否位于另外某项数据之前,如果是，则需要把本数据与pItemData交换顺序
	// 参数：
	//     1.pItemData - 比较项指针
	// ---------------------------------------------------------------------------
	virtual bool IsBeforThan(const CListItemData * pItemData);

	// ---------------------------------------------------------------------------
	// 摘要：
	//     改变排序方式函数
	// ---------------------------------------------------------------------------
	virtual bool ChangeSortMode(const int & col);

	// ---------------------------------------------------------------------------
	// 摘要：
	//     取得本条目选中状态
	// ---------------------------------------------------------------------------
	virtual bool IsHighlight();

	// ---------------------------------------------------------------------------
	// 摘要：
	//     改变排序方式函数
	// ---------------------------------------------------------------------------
	Sample_Pos GetSamplePosNum() const
	{	
		return m_SamplePos;
	}

	// ---------------------------------------------------------------------------
	// 摘要：
	//     改变排序方式函数
	// ---------------------------------------------------------------------------
	Reagent_Pos GetReagentPosNum() const
	{	
		return m_ReagentPos;
	}
private:
	Sample_Pos m_SamplePos;
	Reagent_Pos m_ReagentPos;

private:
	static ListColumn SortColumn;		// 排序列名
	static bool IsAsc;					// 是否升序排，true是，false为降序
};
